# 性别
GENDER = (
    ('male', '男'),
    ('female', '女'),
)
# 结果
RESULT = (
    ('success', '成功'),
    ('fail', '失败'),
    ('error', '错误'),
    ('debug', '测试'),
    ('batch', '批量'),
)
# 阿里签名来源
SIGN_SOURCE = (
    (0, '企事业单位的全称或简称'),
    (1, '工信部备案网站的全称或简称'),
    (2, 'APP应用的全称或简称'),
    (3, '公众号或小程序的全称或简称'),
    (4, '电商平台店铺名的全称或简称'),
    (5, '商标名的全称或简称'),
)
# 阿里短信类型
TEMPLATE_TPYE = (
    (0, '验证码'),
    (1, '短信通知'),
    (2, '推广短信'),
    (3, '国际/港澳台消息'),
)
# 模板审核状态
TEMPLATE_STATUS = (
    (0, '审核中'),
    (1, '审核通过'),
    (2, '审核失败，请在返回参数Reason中查看审核失败原因'),
)
